##### 설정변경코드
* 변수 명이 두번 이상 출력되어도 모두 콘솔에서 보여줄 것
* 
from IPython.core.interactiveshell import InteractiveShell <br> 
InteractiveShell.ast_node_interactivity="all"
* InteractiveShell.ast_node_interactivity : 'all' | 'last' | 'last_expr' | 'none' (기본값은 'last_expr')

#### 데이터 프레임 인덱서 : loc, iloc
- Pandas는 numpy행렬과 같이 쉼표를 사용한 (행 인덱스, 열 인덱스) 형식의 2차원 인덱싱을 지원
    - 특별한 인덱서(indexer) 속성을 제공
    
* loc : 라벨값 기반의 2차원 인덱싱
* iloc : 순서를 나타내는 정수 기반의 2차원 인덱싱

#### 행과 열을 동시에 인덱싱 하는 구조는 기본 자료구조 인덱스와 차이가 있음
- df['열']
- df[:'행'] 슬라이싱이 반드시 필요
- df['열'][:'행']

### 데이터 프레임에서 인덱서 사용
#### loc, iloc 속성을 사용하는 인덱싱
#### pandas 패키지는 [행번호,열번호] 인덱싱 불가
    - iloc 속성 사용하면 가능
        - iloc[행번호,열번호] - 가능
        - loc[행제목,열제목] -가능

##### loc 인덱서 : 행 우선 인덱서

- df.loc[행인덱싱 값] #행우선 인덱서
- df.loc[행인덱싱 값,열인덱싱 값]

    #### 인덱싱 값
    1. 인덱스 데이터(index name, column name)
    2. 인덱스 데이터 슬라이스
    3. 같은 행 인덱스를 갖는 불리언 시리즈(행 인덱싱인 경우)
        - 조건으로 추출 가능
    4. 위 값을 반환하는 함수

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

A    10
B    11
C    12
D    13
Name: a, dtype: int32

##### loc 인덱서에서는 열 단독 인덱싱은 불가능 함

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

    A   B   C   D
b  14  15  16  17

    B   C
a  11  12
b  15  16
c  19  20

#### **boolean selection으로 row 선택하기**

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

a    False
b    False
c     True
Name: A, dtype: bool

    A   B   C   D
c  18  19  20  21

a    False
b    False
c     True
Name: A, dtype: bool

    A   B   C   D
c  18  19  20  21

##### loc 인덱서 슬라이싱

    a   b   c   d
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

    a   b   c   d
1  14  15  16  17
2  18  19  20  21

    a   b   c   d
1  14  15  16  17

##### loc 인덱서 사용 요소 값 접근
- 인덱싱으로 행과 열을 모두 받는 경우
- 문법 : df.loc[행인덱스,열인덱스] - 라벨(문자열)인덱스 사용

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

10

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

#### loc를 이용한 indexing 정리

A    50
B    11
C    12
D    13
Name: a, dtype: int32

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

B    11
C    12
Name: a, dtype: int32

b    14
c    18
Name: A, dtype: int32

    A   B   C   D
a  50  11  12  13
b  14  15  16  17
c  18  19  20  21

    A   B   C   D
a  50  11  12  13
b  14  15  16  17

    A   B   C   D
a  50  11  12  13
b  14  15  16  17

a    11
b    15
Name: B, dtype: int32

    B
a  11
b  15

    B   D
a  11  13
b  15  17

    B   D
a  11  13
c  19  21

### iloc 인덱서(위치 인덱스)
- 라벨(name)이 아닌 위치를 나타내는 정수 인덱스만 받는다.
- 위치 정수값은 0부터 시작
- 데이터프레임.iloc[행,열]

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

11

    B
a  11
b  15

a    11
b    15
Name: B, dtype: int32

    B
a  11
b  15

- 원소들을 분류하여 갯수를 세는 함수 :  value_counts()

In [9]:
df = pd.DataFrame({'num_legs': [2, 4, 4, 6],
                   'num_wings': [2, 0, 0, 0]},
                  index=['falcon', 'dog', 'cat', 'ant'])
df

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

num_legs  num_wings
4         0            2
2         2            1
6         0            1
dtype: int64